### Importing from MySQL

In [2]:
import pandas as pd
import mysql.connector
import sqlalchemy as salc
import numpy as np
import pymysql
# pymysql.install_as_MySQLdb()

In [3]:
dbku = mysql.connector.connect(
host = "localhost",
user = "root",
passwd = "12345",
database = "pandas_tes")

query = "select * from employees"
df = pd.read_sql(query, dbku)
df

   id     nama              email               waktu
0   1   Asnawi    asnawi@yahoo.id 2019-12-09 09:29:39
1   2    Bagas  bagasadi@yahoo.id 2019-12-09 09:29:39
2   3     Evan    evandd@yahoo.id 2019-12-09 09:29:39
3   4  Osvaldo   osvaldo@yahoo.id 2019-12-09 09:29:39

In [1]:
df.to_sql(
    name = "testing", con = dbku
)

NameError: name 'df' is not defined

In [4]:
df.dtypes

id                int64
nama             object
email            object
waktu    datetime64[ns]
dtype: object

type dari waktu otomatis adalah datetime64

__Cara panggil database langsung dari alamatnya__

In [5]:
query = "select * from employees"
alamatDB = "mysql://root:12345@localhost:3306/pandas_tes"
df = pd.read_sql(query, alamatDB)
df

ModuleNotFoundError: No module named 'MySQLdb'

In [94]:
query = "select * from employees"
engine = salc.create_engine("mysql://root:12345@localhost:3306/pandas_tes")
df = pd.read_sql(query, engine.raw_connection())
df

   id     nama              email               waktu
0   1   Asnawi    asnawi@yahoo.id 2019-12-09 09:29:39
1   2    Bagas  bagasadi@yahoo.id 2019-12-09 09:29:39
2   3     Evan    evandd@yahoo.id 2019-12-09 09:29:39
3   4  Osvaldo   osvaldo@yahoo.id 2019-12-09 09:29:39

In [92]:
engine = salc.create_engine("mysql://root:12345@localhost:3306/pandas_tes")
df = pd.read_sql("select * from employees", engine.raw_connection())
df

   id     nama              email               waktu
0   1   Asnawi    asnawi@yahoo.id 2019-12-09 09:29:39
1   2    Bagas  bagasadi@yahoo.id 2019-12-09 09:29:39
2   3     Evan    evandd@yahoo.id 2019-12-09 09:29:39
3   4  Osvaldo   osvaldo@yahoo.id 2019-12-09 09:29:39

In [108]:
engine = salc.create_engine("mysql://root:12345@localhost:3306/pandas_tes")
df = pd.read_sql_query("select * from employees", engine.raw_connection())
df

   id     nama              email               waktu
0   1   Asnawi    asnawi@yahoo.id 2019-12-09 09:29:39
1   2    Bagas  bagasadi@yahoo.id 2019-12-09 09:29:39
2   3     Evan    evandd@yahoo.id 2019-12-09 09:29:39
3   4  Osvaldo   osvaldo@yahoo.id 2019-12-09 09:29:39

In [113]:
# engine = salc.create_engine("mysql://root:12345@localhost:3306/pandas_tes")
# x = engine.raw_connection()
df.to_sql(
    name = "ok",
    con = dbku,
    if_exists = "append"
)

DatabaseError: Execution failed on sql 'SELECT name FROM sqlite_master WHERE type='table' AND name=?;': Not all parameters were used in the SQL statement

In [60]:
dfTlkm = pd.read_csv("TLKM.JK.csv", parse_dates = ["Date"], index_col = ["Date"])
dfTlkm

              Open    High     Low   Close  Adj Close     Volume
Date
2019-06-05  3900.0  3900.0  3900.0  3900.0     3900.0          0
2019-06-06  3900.0  3900.0  3900.0  3900.0     3900.0          0
2019-06-07  3900.0  3900.0  3900.0  3900.0     3900.0          0
2019-06-10  4000.0  4060.0  3970.0  4040.0     4040.0  222522800
2019-06-11  4010.0  4060.0  4000.0  4020.0     4020.0   88861700
...            ...     ...     ...     ...        ...        ...
2019-12-02  3960.0  3960.0  3930.0  3950.0     3950.0   74263500
2019-12-03  3920.0  3940.0  3910.0  3920.0     3920.0   74494000
2019-12-04  3920.0  3990.0  3900.0  3990.0     3990.0   64948300
2019-12-05  3990.0  4080.0  3990.0  4060.0     4060.0  118494800
2019-12-06  4040.0  4100.0  4020.0  4100.0     4100.0   50682100

[133 rows x 6 columns]

In [61]:
dfTlkm[
    dfTlkm["Close"] ==
    dfTlkm["2019-08"]["Close"].max()
]

              Open    High     Low   Close  Adj Close     Volume
Date
2019-08-20  4350.0  4470.0  4340.0  4470.0     4470.0  143171600

In [65]:
dfTlkm.loc["2019-08-05"]

Open              4200.0
High              4220.0
Low               4060.0
Close             4080.0
Adj Close         4080.0
Volume       112253200.0
Name: 2019-08-05 00:00:00, dtype: float64

In [66]:
dfTlkm.loc["2019-09":"2019-11"]["Close"].resample("W").mean()

Date
2019-09-08    4316.0
2019-09-15    4224.0
2019-09-22    4248.0
2019-09-29    4270.0
2019-10-06    4230.0
2019-10-13    4120.0
2019-10-20    4178.0
2019-10-27    4264.0
2019-11-03    4210.0
2019-11-10    4130.0
2019-11-17    4112.0
2019-11-24    4036.0
2019-12-01    3888.0
Freq: W-SUN, Name: Close, dtype: float64

In [67]:
dfTlkm.loc["2019-09":"2019-11"]["Close"].resample("M").mean()

Date
2019-09-30    4266.666667
2019-10-31    4200.869565
2019-11-30    4043.333333
Freq: M, Name: Close, dtype: float64

In [82]:
dfTlkm = pd.read_csv("TLKM.JK.csv", parse_dates = ["Date"], index_col = ["Date"])
dfTlkm = dfTlkm.sort_index()
dfTlkm = dfTlkm.resample("D").sum()
dfTlkm.iloc[:, :5] = dfTlkm.iloc[:, :5].replace(0, np.NaN)
dfTlkm = dfTlkm.fillna(method = "ffill")
dfTlkm

              Open    High     Low   Close  Adj Close     Volume
Date
2019-06-05  3900.0  3900.0  3900.0  3900.0     3900.0          0
2019-06-06  3900.0  3900.0  3900.0  3900.0     3900.0          0
2019-06-07  3900.0  3900.0  3900.0  3900.0     3900.0          0
2019-06-08  3900.0  3900.0  3900.0  3900.0     3900.0          0
2019-06-09  3900.0  3900.0  3900.0  3900.0     3900.0          0
...            ...     ...     ...     ...        ...        ...
2019-12-02  3960.0  3960.0  3930.0  3950.0     3950.0   74263500
2019-12-03  3920.0  3940.0  3910.0  3920.0     3920.0   74494000
2019-12-04  3920.0  3990.0  3900.0  3990.0     3990.0   64948300
2019-12-05  3990.0  4080.0  3990.0  4060.0     4060.0  118494800
2019-12-06  4040.0  4100.0  4020.0  4100.0     4100.0   50682100

[185 rows x 6 columns]

Supaya tidak ada hari yang hilang, gunakan fungsi sort dan ffill